// /*++
// Copyright (c) 2009 Intel Corporation. All rights reserved.
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// --*/
//
// Name: Terminal.uni
//
// Description: Contains the unicode string definitions for the strings
//              in Terminal.sd.
//
//**********************************************************************

/=#
#langdef   en-US "English"
#langdef   zh-Hans "\wide中文\narrow"

//
//UCR support
//
#string STR_CONSOLE_REDIRECTION_CONF_TITLE   #language en-US  "Console Redirection"
                                             #language zh-Hans  "\wide串口重定向\narrow"
#string STR_CONSOLE_REDIRECTION_CONF_HELP    #language en-US  "Configure Console Redirection"
                                             #language zh-Hans  "\wide串口重定向配置菜单。\narrow"
#string STR_UCR                              #language en-US  "Console Redirection"
                                             #language zh-Hans  "\wide串口重定向\narrow"
#string STR_UCR_HELP                         #language en-US  "When console redirection is enabled and boot to DOS, only under MS-DOS 7.1 or below and Free DOS the output is normal. Windows 98 MS-DOS is not supported."
                                             #language zh-Hans  "DOS\wide串口重定向，只支持\narrowMS-DOS 7.1\wide及下版本，不支持\narrowWindows 98 MS-DOS"
#string STR_SERIAL_PORT_SELECT               #language en-US  "Serial Port Select"
                                             #language zh-Hans  "\wide串口选择\narrow"
#string STR_SERIAL_PORT_SELECT_HELP          #language en-US  "select serial port for console redirection. make sure the selected port is enabled."
                                             #language zh-Hans  "\wide选择重定向串口，请先打开串口。\narrow"
#string STR_SERIAL_PORT_SELECT_COM0          #language en-US  "COM0"
                                             #language zh-Hans  "COM0"
#string STR_SERIAL_PORT_SELECT_COM1          #language en-US  "COM1"
                                             #language zh-Hans  "COM1"
#string STR_SERIAL_PORT_SELECT_COM2          #language en-US  "COM2"
                                             #language zh-Hans  "COM2"
#string STR_SERIAL_PORT_SELECT_COM3          #language en-US  "COM3"
                                             #language zh-Hans  "COM3"
#string STR_SERIAL_PORT_SELECT_COM4          #language en-US  "COM4"
                                             #language zh-Hans  "COM4"                                             
#string STR_SOL_REDIRECTION_PORT             #language en-US  "SOL Redirect"
                                             #language zh-Hans  "SOL Redirect"
#string STR_SERIAL_BAUDRATE                  #language en-US  "Serial Port Baudrate"
                                             #language zh-Hans  "\wide串口波特率\narrow"
#string STR_SERIAL_BAUDRATE_HELP             #language en-US  "Select Serial Port Baudrate."
                                             #language zh-Hans  "\wide选择串口波特率。\narrow"
#string STR_SERIAL_BAUDRATE_9600             #language en-US  "9600"
                                             #language zh-Hans  "9600"
#string STR_SERIAL_BAUDRATE_19200            #language en-US  "19200"
                                             #language zh-Hans  "19200"
#string STR_SERIAL_BAUDRATE_38400            #language en-US  "38400"
                                             #language zh-Hans  "38400"
#string STR_SERIAL_BAUDRATE_57600            #language en-US  "57600"
                                             #language zh-Hans  "57600"
#string STR_SERIAL_BAUDRATE_115200           #language en-US  "115200"
                                             #language zh-Hans  "115200"
#string STR_TERMINAL_TYPE                    #language en-US  "Terminal Type"
                                             #language zh-Hans  "\wide终端类型\narrow"
#string STR_TERMINAL_TYPE_HELP               #language en-US  "select the target terminal type. Chose VT-UTF8 to show Chinese Font."
                                             #language zh-Hans  "\wide选择终端类型。中文显示需要选择\narrowVT-UTF8\wide。\narrow"
#string STR_TERMINAL_TYPE_ANSI               #language en-US  "ANSI"
                                             #language zh-Hans  "ANSI"
#string STR_TERMINAL_TYPE_VT100              #language en-US  "VT100"
                                             #language zh-Hans  "VT100"
#string STR_TERMINAL_TYPE_VT100_PLUS         #language en-US  "VT100+"
                                             #language zh-Hans  "VT100+"
#string STR_TERMINAL_TYPE_UTF8               #language en-US  "VT-UTF8"
                                             #language zh-Hans  "VT-UTF8"
#string STR_ENABLE                           #language en-US  "Enabled"
                                             #language zh-Hans  "\wide打开\narrow"
#string STR_DISABLE                          #language en-US  "Disabled"
                                             #language zh-Hans  "\wide关闭\narrow"
                                             
#string STR_CONSOLE_MODE                     #language en-US  "Console Mode"
                                             #language zh-Hans  "\wide终端模式\narrow"
#string STR_CONSOLE_MODE_HELP                #language en-US  "Console Text Display Resolution "
                                             #language zh-Hans  "\wide终端文本显示分辨率\narrow"
#string STR_CONSOLE_MODE_80_25               #language en-US  " 80 X 25"
                                             #language zh-Hans  " 80 X 25"
#string STR_CONSOLE_MODE_100_31              #language en-US  "100 X 31"
                                             #language zh-Hans  "100 X 31"
#string STR_CONSOLE_MODE_128_40              #language en-US  "128 X 40"
                                             #language zh-Hans  "128 X 40"

#string STR_OBD_MGMT_PORT                    #language en-US  "Out-of-Band Mgmt Port"
                                             #language zh-Hans  "\wide带外管理端口\narrow"
#string STR_LEGACY_REDIRECTION_PORT          #language en-US  "Legacy Serial Redirection Port"
                                             #language zh-Hans  "\wide传统串口重定向端口\narrow"
